In [15]:
import pandas as pd
import numpy as np

Q1 - For the following code, which of the following statements will not return True?

In [2]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj1 = pd.Series(sdata)
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj2 = pd.Series(sdata, index=states)
obj3 = pd.isnull(obj2)

In [10]:
obj2

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [11]:
obj3

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [4]:
obj2['California'] == None

False

In [8]:
obj3['California']

True

In [9]:
import math
math.isnan(obj2['California'])

True

In [12]:
x = obj2['California']
obj2['California'] != x

True

Q2 - In below python code, the keys of the dictionary d represent student ranks and the value for each key is a student name. Which of the following can be used to extract rows with student ranks that are lower than or equal to 3?

In [14]:
d = {
    '1': 'Alice',
    '2': 'Bob',
    '3': 'Rita',
    '4': 'Molly',
    '5': 'Ryan'
}
S = pd.Series(d)
S.iloc[0:3]

1    Alice
2      Bob
3     Rita
dtype: object

Q3 - Suppose we have a DataFrame named df. We want to change the original DataFrame df in a way that all the column names are cast to upper case. Which of the following expressions is incorrect to perform the same?

In [20]:
df = pd.DataFrame(np.arange(1,13).reshape(3,4),columns=list('abcd'))
df.rename(mapper = lambda x : x.upper(), axis = 1)
df

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

Q4 - For the given DataFrame df we want to keep only the records with a toefl score greater than 105. Which of the following will not work?

In [32]:
df = pd.DataFrame({'gre score':[337, 324, 316, 322, 314],
                   'tofel score':[118, 107, 104, 110, 103]})
df

   gre score  tofel score
0        337          118
1        324          107
2        316          104
3        322          110
4        314          103

In [33]:
df.where(df['tofel score']>105)

   gre score  tofel score
0      337.0        118.0
1      324.0        107.0
2        NaN          NaN
3      322.0        110.0
4        NaN          NaN

In [34]:
df.where(df['tofel score']>105).dropna()

   gre score  tofel score
0      337.0        118.0
1      324.0        107.0
3      322.0        110.0

In [35]:
df[df['tofel score']>105]

   gre score  tofel score
0        337          118
1        324          107
3        322          110

Q5 - Which of the following can be used to create a DataFrame in Pandas?

2D ndarray, pandas series obj, python dict

Q6 - Which of the following is an incorrect way to drop entries from the Pandas DataFrame named df shown below?

In [30]:
df = pd.DataFrame(obj2)
print(df)
df.drop(['California','Oregon'])

                  0
California      NaN
Ohio        35000.0
Oregon      16000.0
Texas       71000.0

             0
Ohio   35000.0
Texas  71000.0

Q7 - For the Series s1 and s2 defined below, which of the following statements will give an error?

In [42]:
s1 = pd.Series({1: 'Alice', 2: 'Jack', 3: 'Molly'})
s2 = pd.Series({'Alice': 1, 'Jack': 2, 'Molly': 3})
print(s1.loc[1])
print(s2[1])
print(s2.iloc[1])
# print(s2.loc[1]) # KeyError

Alice
2
2

Q8 - Which of the following statements is incorrect?

a) in series s, s.loc[label] is used to get all data where index is label  
b) loc and iloc are used in Pandas  
c) s.iteritems() can be used to iterate on Series s  
d) we can't use s1.appen(s2) directly if s1 and s2 are series

In [44]:
s1.append(s2)

1        Alice
2         Jack
3        Molly
Alice        1
Jack         2
Molly        3
dtype: object

In [46]:
for index, value in s1.iteritems():
    print(f'Index - {index} -> Value - {value}')

Index - 1 -> Value - Alice
Index - 2 -> Value - Jack
Index - 3 -> Value - Molly

Q9 - For the given DataFrame df shown above, we want to get all records with a toefl score greater than 105 but smaller than 115. Which of the following expressions is incorrect to perform the same?

In [47]:
df

   gre score  tofel score
0        337          118
1        324          107
2        316          104
3        322          110
4        314          103

In [48]:
(df['tofel score'] > 105) & (df['tofel score'] < 115)

0    False
1     True
2    False
3     True
4    False
Name: tofel score, dtype: bool

In [50]:
df[(df['tofel score'] > 105) & (df['tofel score'] < 115)]

   gre score  tofel score
1        324          107
3        322          110

In [51]:
df[df['tofel score'].gt(105) & df['tofel score'].lt(115)]

   gre score  tofel score
1        324          107
3        322          110

In [49]:
df[(df['tofel score'].isin(range(106, 115)))]

   gre score  tofel score
1        324          107
3        322          110

Q10 - Which of the following is the correct way to extract all information related to the student named Alice from the DataFrame df given below:

In [56]:
df = pd.DataFrame({'Name':['Alice', 'Jack'],
                   'Age':[20, 22],
                   'Gender':['F', 'M']}, index=['Maths', 'SS'])
df.index.name = '(Major)'
df

          Name  Age Gender
(Major)
Maths    Alice   20      F
SS        Jack   22      M

In [58]:
df.T['Maths']

Name      Alice
Age          20
Gender        F
Name: Maths, dtype: object

In [64]:
# df['Maths'] # KeyError
# df.iloc['Maths'] # TypeError-Can't index by location index with a non-integer key
# df['Alice'] # KeyError